Revit 2024 API
Categories Class
The Categories object is a map that contains all the top-level Category objects within the Document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Categories : CategoryNameMap
Visual Basic
Public Class Categories _
	Inherits CategoryNameMap
Visual C++
public ref class Categories : public CategoryNameMap
Remarks
Use this object to retrieve categories by name or by BuiltInCategory id.
Examples
CopyC#
// Get settings of current document
Settings documentSettings = document.Settings;
// Get all categories of current document
Categories groups = documentSettings.Categories;
// Show the number of all the categories to the user
String prompt = "Number of all categories in current Revit document:" + groups.Size;
// get Floor category according to OST_Floors and show its name
Category floorCategory = groups.get_Item(BuiltInCategory.OST_Floors);
prompt += floorCategory.Name;
// Give the user some information
TaskDialog.Show("Revit",prompt);
CopyVB.NET
' Get settings of current document
Dim documentSettings As Settings = document.Settings
' Get all categories of current document
Dim groups As Categories = documentSettings.Categories
' Show the number of all the categories to the user
Dim prompt As [String] = "Number of all categories in current Revit document:" + groups.Size
' get Floor category according to OST_Floors and show its name
Dim floorCategory As Category = groups.Item(BuiltInCategory.OST_Floors)
prompt += floorCategory.Name
' Give the user some information
TaskDialog.Show("Revit", prompt)
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CategoryNameMap
 Autodesk.Revit.DB.Categories
See Also
Categories Members
Autodesk.Revit.DB Namespace